tap "homebrew/cask-fonts"
tap "railwaycat/emacsmacport"

brew "ag"
brew "bash"
brew "bat"
brew "cmake"
brew "ctags"
brew "elm"
brew "elm-format"
brew "exa"
brew "fd"
brew "fish"
brew "fzf"
brew "git"
brew "global"
brew "ispell"
brew "ktlint"
brew "mas"
brew "node"
brew "neovim"
brew "pyenv"
brew "rbenv"
brew "ripgrep"
brew "sd"
brew "shellcheck"
brew "stow"
brew "tealdeer"
brew "terminal-notifier"
brew "tmux"
brew "wget"

cask "1password"
cask "colorpicker-developer"
cask "dash"
cask "dropbox"
cask "emacs-mac"
cask "firefox"
cask "flux"
cask "font-fira-mono"
cask "font-fira-mono-for-powerline"
cask "gitup"
cask "gpg-suite"
cask "iina"
cask "imageoptim"
cask "lingon-x"
cask "little-snitch"
cask "macdown"
cask "postgres"
cask "protonvpn"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "shrinkit"
cask "sketch"
cask "spectacle"
cask "transmission"
cask "transmit"

mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "Cookie", id: 1473091386
mas "DaisyDisk", id: 411643860
mas "Fantastical", id: 975937182
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "PDF Expert", id: 1055273043
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
