#
# Auto-generated using `brew bundle --dump --describe`.
#
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "railwaycat/emacsmacport"
tap "zero-sh/tap"

# Bourne-Again SHell, a UNIX command interpreter
brew "bash"

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"

# Decentralized dependency manager for Cocoa
brew "carthage"

# Emacs dependency management
brew "cask"

# Collection of LLDB commands to assist debugging iOS apps
brew "chisel"

# Reimplementation of ctags(1)
brew "ctags"

# Tool for managing dock items
brew "dockutil"

# Select default apps for documents and URL schemes on macOS
brew "duti"

# Maintain consistent coding style between multiple editors
brew "editorconfig"

# Functional programming language for building browser-based GUIs
brew "elm"

# Elm source code formatter, inspired by gofmt
brew "elm-format"

# Modern replacement for 'ls'
brew "exa"

# Simple, fast and user-friendly alternative to find
brew "fd"

# User-friendly command-line shell for UNIX-like operating systems
brew "fish"

# Command-line fuzzy finder written in Go
brew "fzf"

# Distributed revision control system
brew "git"

# Syntax-highlighting pager for git and diff output
brew "git-delta"

# Source code tag system
brew "global"

# OpenGL and OpenGL ES reference compiler for shading languages
brew "glslang"

# Terminal interface for viewing git repositories
brew "grv"

# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"

# Command-line accounting tool
brew "hledger"

# Haskell source code suggestions
brew "hlint"

# Command-line, double-entry accounting tool
brew "ledger"

# Mac App Store command-line interface
brew "mas"

# Remote terminal application
brew "mosh"

# Text-based UI library
brew "ncurses"

# Install and debug iPhone apps from the command-line
brew "ios-deploy"

# Swiss-army knife of markup format conversion
brew "pandoc"

# International Ispell
brew "ispell"

# Anti-bikeshedding Kotlin linter with built-in formatter
brew "ktlint"

# Small memory footprint, flexible web-server
brew "lighttpd"

# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"

# Platform built on V8 to build network applications
brew "node"

# Search PDFs for strings matching a regular expression
brew "pdfgrep"

# Python version management
brew "pyenv"

# File browser
brew "ranger"

# Ruby version manager
brew "rbenv"

# Tools for file renaming
brew "renameutils"

# Search tool like grep and The Silver Searcher
brew "ripgrep"

# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"

# Intuitive find & replace CLI
brew "sd"

# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"

# Autoformat shell script source code
brew "shfmt"

# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"

# Formatting tool for reformatting Swift code
brew "swiftformat"

# Tool to enforce Swift style and conventions
brew "swiftlint"

# Scripting with easy zero-conf dependency imports
brew "swift-sh"

# Very fast implementation of tldr in Rust
brew "tealdeer"

# Send macOS User Notifications from the command-line
brew "terminal-notifier"

# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"

# Terminal multiplexer
brew "tmux"

# Language for application scale JavaScript development
brew "typescript"

# Internet file retriever
brew "wget"

# Fast static site generator in a single binary with everything built-in
brew "zola"

# Small tool to set macOS user defaults from a YAML file
brew "zero-sh/tap/apply-user-defaults"

# Radically simple personal bootstrapping tool for macOS
brew "zero-sh/tap/zero"

cask "1password"
cask "acorn"
cask "alacritty"
cask "backblaze"
cask "calibre"
cask "chromium"
cask "dash"
cask "discord"
cask "dropbox"
cask "emacs-mac"
cask "firefox"
cask "flux"
cask "font-fira-mono"
cask "font-fira-mono-for-powerline"
cask "gitup"
cask "gpg-suite"
cask "iina"
cask "imageoptim"
cask "lingon-x"
cask "little-snitch"
cask "pacifist"
cask "pine"
cask "protonvpn"
cask "qlcolorcode"
cask "qlstephen"
cask "rectangle"
cask "shrinkit"
cask "sketch"
cask "transmission"
cask "transmit"

mas "Amphetamine", id: 937984704
mas "Cookie", id: 1473091386
mas "DaisyDisk", id: 411643860
mas "Fantastical", id: 975937182
mas "Haskell", id: 841285201
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "PDF Expert", id: 1055273043
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Slack", id: 803453959
mas "xScope", id: 889428659
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
